# KeynoteTable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceTypes..::..BuiltInExternalResourceTypes..::..KeynoteTable Property
ExternalResourceTypes..::..BuiltInExternalResourceTypes Class See Also
---
An external resource type representing keynote data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalResourceType KeynoteTable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KeynoteTable As ExternalResourceType
	Get
```

Visual C++
---
```text
public:
static property ExternalResourceType^ KeynoteTable {
	ExternalResourceType^ get ();
}
```

# See Also
ExternalResourceTypes..::..BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace